#+TITLE: Bayesian Statistics the Fun Way - solutions for chapter 5
#+OPTIONS: tex:t :export both
#+STARTUP: latexpreview
#+PROPERTY: session *Python*


* Problems - chapter 5

** Q1. 
You want to use the beta distribution to determine whether or not a 
coin you have is a fair coin --meaning that the coin gives you head and
tails equally. You flip the coin 10 times and get 4 heads and 6 tails.
Using the beta distribution, what is the probability that the coin will
land on heads more than 60% of the time?

#+BEGIN_SRC python :results output :eval yes
from scipy.stats import beta

# Create a continuous random variable
a = 4   # heads
b = 6   # tails
solution = 1. - beta.cdf(0.6, a, b) 
print(f"The probability that the coin will land on heads more than 60% of the time is {100*solution}%")
#+END_SRC

#+RESULTS:
: The probability that the coin will land on heads more than 60% of the time is 9.935257600000003%

The probability that the coin will land on heads more than 60% of the time is 9.93%


** Q2.
You flip the coin 10 more times and now you have 9 heads and 11 tails total.
What is the probability that the coin is fair, using our definition of fair,
give or take 5 percent?

#+BEGIN_SRC python :results output :eval yes
from scipy.stats import beta
# Create a continuous random variable
a = 9   # heads
b = 11   # tails
solution = beta.cdf(0.55, a, b) - beta.cdf(0.45, a, b) 
print(f"The probability that the coin is fair {100*solution}% - 45 - 55%")

#+END_SRC

#+RESULTS:
: The probability that the coin is fair 30.988001565130418% - 45 - 55%

The probability that the coin is fair 30.988% - assuming 45-55% head/tails 

** Q3.
Data is the best way to become more confident on your assertions. You
flip the coin 200 more times and end up with 109 heads and 111 tails.
Now what is the probability that the coin is fair, give or take 5 percent?

#+BEGIN_SRC python :results output
from scipy.stats import beta
# Create a continuous random variable
a = 109   # heads
b = 111   # tails
solution = beta.cdf(0.55, a, b) - beta.cdf(0.45, a, b) 
print(f"The probability that the coin is fair {100*solution}% - 45 - 55%")

#+END_SRC

#+RESULTS:
: The probability that the coin is fair 85.89371426532354% - 45 - 55%

The probability that the coin is fair 85.894% - assuming 45-55% head/tails,
more data shows a value closer to our expectations.
